app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`) VALUES ('Gian', 'giandelegencia0419@gmail.com', '$2y$10$JFElBkiEEEy0n/u.tscIvOWhD7jev9Ypm/x1N/HDbVoK5zBsbtsBK', 'student', '2026-10-09 20:11:31')
---
    public function storeRegister()
    {
        $rules = [
            'name'                  => 'required|min_length[3]',
            'email'                 => 'required|valid_email|is_unique[users.email]',
            'password'              => 'required|min_length[6]',
            'password_confirmation' => 'required|matches[password]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();
        $userModel->insert([
            'name'       => $this->request->getPost('name'),
            'email'      => $this->request->getPost('email'),
            'password'   => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'       => 'student',
            'created_at' => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `users`
WHERE `email` = 'giandelegencia0419@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Invalid email or password.');
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $this->request->getPost('email'))->first();